[
    {
        "Job URL": "https://www.naukri.com/job-listings-artificial-intelligence-machine-learning-engineer-neo4j-gloify-bengaluru-3-to-5-years-270325922552",
        "Job Title": "Artificial Intelligence / Machine Learning Engineer - Neo4j",
        "Company": "Gloify",
        "Job Description": {
            "Description": "Artificial Intelligence/Machine Learning Engineer - Neo4j/Deep Learning\nRole : AI/ML Engineer\n\nLocation : Bangalore\n\nExperience : 3-4 Years\n\nJoining : Immediate (Preferred)\n\nKey Responsibilities :\n\n- Design, develop, and deploy AI/ML models for data-driven applications.\n\n- Work with Neo4j (Graph Database) to model and analyze complex relationships in datasets.\n\n- Implement machine learning algorithms for recommendation systems, predictive analytics, and knowledge graphs.\n\n- Develop and optimize graph-based data pipelines and algorithms using Neo4j Cypher queries.\n\n- Process, clean, and analyze large datasets for feature engineering and model training.\n\n- Integrate ML models into scalable applications using Python, TensorFlow, PyTorch, or Scikit-learn.\n\n- Optimize model performance, accuracy, and scalability for production deployment.\n\n- Collaborate with data scientists, backend engineers, and product teams to enhance AI capabilities.\n\nRequired Skills :\n\n- Machine Learning & Deep Learning : Hands-on with ML models, classification, clustering, NLP.\n\n- Neo4j & Graph Databases : Experience in graph data modeling, Cypher queries, and data relationships.\n\n- Programming : Proficiency in Python, TensorFlow, PyTorch, Scikit-learn.\n\n- Data Engineering : Experience with ETL pipelines, data preprocessing, and feature engineering.\n\n- Big Data & Cloud : Exposure to Spark, Kafka, AWS/GCP/Azure (Good to have).\n\n- MLOps & Deployment : Working knowledge of Docker, Kubernetes, CI/CD pipelines.\n\n- Strong Analytical & Problem-Solving Skills for AI-driven applications.\n\nGood to Have :\n\n- Experience with Graph Neural Networks (GNNs) and Graph Data Science.\n\n- Knowledge of NLP, Computer Vision, or Time-Series Analysis.\n\n- Exposure to automated ML pipelines and model monitoring."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-wipro-limited-bengaluru-2-to-6-years-260325925005",
        "Job Title": "Machine Learning Engineer",
        "Company": "Wipro",
        "Job Description": {
            "Description": " Long Description \n\n  Study and transform data science prototypes.  \n  Design machine learning systems  "
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-avani-infosoft-bengaluru-1-to-2-years-280325005927",
        "Job Title": "Machine Learning Engineer",
        "Company": "Avani Infosoft",
        "Job Description": {
            "Description": "Model Development & Training:\nDevelop and train machine learning models, specifically in the domain of computer vision (e.g., object detection, image classification, segmentation).\nOptimize model performance by tuning hyperparameters and improving training pipelines.\nData Preparation & Processing:\nCollect, clean, and preprocess image and video datasets for training models.\nImplement data augmentation and synthetic data generation techniques.\nModel Evaluation & Analysis:\nEvaluate model performance using appropriate metrics (e.g., precision, recall, F1-score).\nPerform error analysis to identify model weaknesses and suggest improvements.\nModel Deployment & Integration:\nAssist in deploying trained models into production environments.\nWork with software engineers to integrate computer vision models into applications or services.\nResearch & Innovation:\nStay updated on the latest trends and advancements in computer vision and machine learning.\nExperiment with state-of-the-art techniques such as transfer learning, self-supervised learning, and GANs.Role & responsibilities\n\nPreferred candidate profile\nProficiency in Python and ML frameworks (e.g., TensorFlow, PyTorch).\nFamiliarity with computer vision libraries (e.g., OpenCV, scikit-image).\nUnderstanding of machine learning concepts, including supervised and unsupervised learning.\nKnowledge of deep learning architectures (e.g., CNNs, RNNs, Transformers)."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-ml-leading-it-co-bangalore-hindco-recruitment-consultants-hyderabad-chennai-bengaluru-4-to-9-years-030425013435",
        "Job Title": "Machine Learning Engineer (ML) | Leading IT Co. | Bangalore",
        "Company": "Hiring for - Leading IT Co.",
        "Job Description": {
            "Description": "- Architects, develops and programs integrated software solutions, in support of development, deployment & life cycle of machine learning models.\n\n- Builds & maintains robust data pipelines, monitoring systems in distributed computing environments.\n\nRequired Candidate profile\n- 4+ years of work experience, preferably in computer programming languages, machine learning, algorithms, statistical methods, or a related field.\n\n- Experience with cloud environments (GCP/AWS)."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-resmed-bengaluru-3-to-8-years-240325500801",
        "Job Title": "Machine Learning Engineer",
        "Company": "Resmed",
        "Job Description": {
            "Description": "- Lead the design and development of advanced systems for automated data collection, curation, and ML model training.\n- Write production grade code with proper unit test coverage\n- Collaborate with cross-functional teams, including product, UX, and engineering, to architect ML solutions tailored to the needs of caregivers and home health services.\n- Drive innovation by utilizing the latest deep learning libraries and technologies to develop solutions for predictive analytics, workflow optimization, and patient care improvement.\n- Mentor and provide technical leadership to ML engineers and data scientists, fostering best practices and technical excellence.\n- Build and deploy highly scalable, production-ready ML services, ensuring reliability and high-quality performance.\n- Research, implement, and deploy innovative algorithms to address complex healthcare challenges, such as risk prediction and personalized care plans.\n- Optimize ML pipelines and ensure their seamless integration into production environments using state-of-the-art deployment tools and practices.\n- Analyze large, distributed datasets to uncover actionable insights that improve caregiver workflows and enhance patient care.\n- Ensure models meet healthcare industry standards for explainability, fairness, and compliance with regulations like HIPAA.\n  Lets Talk About You\n- Education: Master s or Bachelor s degree in Computer Science, Machine Learning, or a related field.\n  - Experience:\n- 3+ years of hands-on experience in ML model development, data pipelines, and feature engineering.\n- Strong expertise in Python programming and frameworks like FastAPI, pydantic, pandas, numpy.\n- Good understanding of Test Driven Development\n- Ability to follow industry standards in Object Oriented Programming software development\n- Experience with cloud platforms, particularly AWS (e.g., SageMaker, S3, Lambda, DynamoDB, API Gateway).\n- Proficient in building CI/CD pipelines and deploying scalable solutions with Kubernetes or similar technologies.\n- Expertise in handling and processing large datasets, including distributed systems such as Hadoop or Spark.\n  - Skills:\n- Advanced understanding of machine learning techniques, including deep learning, time series analysis, and recommendation systems.\n- Ability to design end-to-end ML workflows, from data ingestion to production deployment and monitoring.\n- Exceptional problem-solving skills and a passion for leveraging AI to improve home healthcare services.\n  What You Can Expect\nA supportive environment that focuses on peoples development and best implementation\nOpportunity to design, influence, and be innovative.\nWork with inclusive global teams and the open sharing of new ideas. We want your ideas!\nBe supported both inside and outside of the work environment.\nThe opportunity to build something meaningful and see a direct positive impact on people s lives!\nDream big, iterate and experiment to drive innovation."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-ii-t-s-booking-holdings-india-private-limited-bengaluru-5-to-9-years-240325905355",
        "Job Title": "Machine Learning Engineer II - T&S",
        "Company": "Booking Holdings",
        "Job Description": {
            "Description": "Role Description\nBooking Holdings (NASDAQ: BKNG) is the world leader in online travel and related services, provided to customers and partners in over 220 countries and territories through six primary consumer-facing brands - Booking.com, KAYAK, Priceline, Agoda.com, Rentalcars.com, and OpenTable. The mission of Booking Holdings is to make it easier for everyone to experience the world. During 2019, the Company had consolidated revenues and net income of $15.1 billion and $4.9 billion, respectively, and a current market value of approximately $90 billion.\nBooking Holdings Bangalore is a Center of Excellence based in Bangalore, India and a legal entity of Booking Holdings Inc. The Center was created to support the increasing business demands of the Booking Holdings Brands. The Center of Excellence provides access to specialized and highly skilled talent, leading industry best practices, and collaboration opportunities across all of the Booking Holdings brands and business units."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-cannyfore-technology-solutions-hyderabad-coimbatore-bengaluru-4-to-8-years-010425003676",
        "Job Title": "Machine Learning Engineer",
        "Company": "Cannyfore Technology Solutions",
        "Job Description": {
            "Description": "Strong proficiency in Python for ML workflows (must-have); familiarity with Java/Scala is a plus.\nExperience building production-grade ML models for real-time or low-latency systems.\nHands-on with scikit-learn, XGBoost, and optionally PyTorch or TensorFlow.\nFamiliar with MLFlow, Airflow, and deploying models using APIs or inference services.\nComfortable working in GCP, AWS, or Azure environments.\nBuilds production-ready ML models for bid shaping, audience prediction, and adaptive optimization.\nBuild real-time ML models for bid shaping using OpenRTB signals and auction dynamics."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-python-machine-learning-engineer-infosys-limited-bengaluru-3-to-5-years-270325913931",
        "Job Title": "Python Machine learning Engineer",
        "Company": "Infosys",
        "Job Description": {
            "Description": "Responsibilities\nResponsible for successful delivery of MLOps solutions and services in client consulting environments; Define key business problems to be solved; formulate high level solution approaches and identify data to solve those problems, develop, analyze/draw conclusions and present to client.\nAssist clients with operationalization metrics to track performance of ML Models Agile trained to manage team effort and track through JIRA High Impact Communication- Assesses the target audience need, prepares and practices a logical flow, answers audience questions appropriately and sticks to timeline."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-nielsen-sports-bengaluru-2-to-5-years-010425501545",
        "Job Title": "Machine learning Engineer",
        "Company": "Nielsen Sports",
        "Job Description": {
            "Description": "Nielsen is seeking an organized, detail oriented, team player, to join the Engineering team in the role of Software ML Engineer. Nielsen s Audience Measurement Engineering platforms support the measurement of television viewing in more than 30 countries around the world. The Software Engineer will be responsible to define, develop, test, analyze, and deliver technology solutions within Nielsen s Collections platforms.\nRequired skills\nBachelors degree in Computer Science or equivalent degree.\n3+ years of software experience Experience with Machine learning frameworks and models.\nPytorch experience preferred Strong understanding of statistical analysis and mathematical data manipulation Work with web technology including Java, Python, JavaScript, React/Redux, Kotlin.\nFollow best practices for software development and deployment.\nUnderstanding of relational database, big data, and experience in SQL.\nProficient at using GIT, GitFlow, JIRA, Gitlab and Confluence. Strong analytical and problem solving skills.\nOpen-minded and passionate to learn and grow technology skills.\nStrong sense of accountability Solution-focused and ability to drive change within the organization.\nExperience in writing unit/integration tests including test automation.\nStrong testing and debugging abilities, functional, analytical and technical abilities, ability to find bugs, attention to detail, troubleshooting\n\nAdditional Useful Skills\nA fundamental understanding of the AWS ecosystem (EC2, S3, EMR, Lambda, etc)\nExperienced in building RESTful APIs.\nExperience in writing unit/integration tests including test automation.\nPlease be aware that job-seekers may be at risk of targeting by scammers seeking personal data or money. Nielsen recruiters will only contact you through official job boards, LinkedIn, or email with a nielsen. com domain. Be cautious of any outreach claiming to be from Nielsen via other messaging platforms or personal email addresses. Always verify that email communications come from an @ nielsen. com address. If youre unsure about the authenticity of a job offer or communication, please contact Nielsen directly through our official website or verified social media channels."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-engineer-principal-manager-machine-learning-ai-qualcomm-india-pvt-ltd-bengaluru-8-to-13-years-190325913523",
        "Job Title": "Engineer, Principal/Manager - Machine Learning, AI",
        "Company": "Qualcomm",
        "Job Description": {
            "Description": "Job Area: Engineering Group, Engineering Group > Systems Engineering\n\nGeneral Summary:\n\nAs a leading technology innovator, Qualcomm pushes the boundaries of what's possible to enable next-generation experiences and drives digital transformation to help create a smarter, connected future for all. As a Qualcomm Systems Engineer, you will research, design, develop, simulate, and/or validate systems-level software, hardware, architecture, algorithms, and solutions that enables the development of cutting-edge technology. Qualcomm Systems Engineers collaborate across functional teams to meet and exceed system-level requirements and standards.\n\nMinimum Qualifications:\nBachelor's degree in Engineering, Information Systems, Computer Science, or related field and 8+ years of Systems Engineering or related work experience.\nOR\nMaster's degree in Engineering, Information Systems, Computer Science, or related field and 7+ years of Systems Engineering or related work experience.\nOR\nPhD in Engineering, Information Systems, Computer Science, or related field and 6+ years of Systems Engineering or related work experience.\n\nPrincipal Engineer \"“ Machine Learning\n\nWe are looking for a Principal AI/ML Engineer with expertise in\n\nmodel inference,\n\noptimization,\n\ndebugging, and\n\nhardware acceleration. This role will focus on building efficient AI inference systems, debugging deep learning models, optimizing AI workloads for low latency, and accelerating deployment across diverse hardware platforms.\n\nIn addition to hands-on engineering, this role involves\n\ncutting-edge research in\n\nefficient deep learning, model compression, quantization, and AI hardware-aware optimization techniques. You will explore and implement\n\nstate-of-the-art AI acceleration methods while collaborating with\n\nresearchers, industry experts, and open-source communities to push the boundaries of AI performance.\n\nThis is an exciting opportunity for someone passionate about\n\nboth applied AI development and AI research, with a strong focus on\n\nreal-world deployment, model interpretability, and high-performance inference.\n\nEducation & Experience:\n\n\n20+ years of experience in AI/ML development, with at least\n\n5 years in model inference, optimization, debugging, and Python-based AI deployment.\nMaster\"™s or Ph.D. in\n\nComputer Science, Machine Learning, AI\n\n\nLeadership & Collaboration\nLead a team of AI engineers in\n\nPython-based AI inference development.\nCollaborate with\n\nML researchers, software engineers, and DevOps teams to deploy optimized AI solutions.\nDefine and enforce\n\nbest practices for debugging and optimizing AI models\n\n\nKey Responsibilities\n\nModel Optimization & Quantization\nOptimize deep learning models using\n\nquantization (INT8, INT4, mixed precision etc), pruning, and knowledge distillation.\nImplement\n\nPost-Training Quantization (PTQ) and Quantization-Aware Training (QAT) for deployment.\nFamiliarity with\n\nTensorRT, ONNX Runtime, OpenVINO, TVM\n\n\n\n\nAI Hardware Acceleration & Deployment\nOptimize AI workloads for\n\nQualcomm Hexagon DSP, GPUs (CUDA, Tensor Cores), TPUs, NPUs, FPGAs, Habana Gaudi, Apple Neural Engine.\nLeverage\n\nPython APIs for hardware-specific acceleration, including\n\ncuDNN, XLA, MLIR.\nBenchmark models on\n\nAI hardware architectures and debug performance issues\n\n\n\n\nAI Research & Innovation\nConduct\n\nstate-of-the-art research on\n\nAI inference efficiency, model compression, low-bit precision, sparse computing, and algorithmic acceleration.\nExplore\n\nnew deep learning architectures (Sparse Transformers, Mixture of Experts, Flash Attention) for better inference performance.\nContribute to\n\nopen-source AI projects and publish findings in top-tier ML conferences (NeurIPS, ICML, CVPR).\nCollaborate with\n\nhardware vendors and AI research teams to optimize deep learning models for next-gen AI accelerators.\n\n\nDetails of Expertise:\nExperience optimizing\n\nLLMs, LVMs, LMMs for inference\nExperience with\n\ndeep learning frameworks:TensorFlow, PyTorch, JAX, ONNX.\nAdvanced skills in\n\nmodel quantization, pruning, and compression.\nProficiency in\n\nCUDA programming and Python GPU acceleration using\n\ncuPy, Numba, and TensorRT.\nHands-on experience with\n\nML inference runtimes (TensorRT, TVM, ONNX Runtime, OpenVINO)\nExperience working with RunTimes Delegates (TFLite, ONNX, Qualcomm)\nStrong expertise in\n\nPython programming, writing optimized and scalable AI code.\nExperience with\n\ndebugging AI models, including\n\nexamining computation graphs using Netron Viewer, TensorBoard, and ONNX Runtime Debugger.\nStrong debugging skills using\n\nprofiling tools (PyTorch Profiler, TensorFlow Profiler, cProfile, Nsight Systems, perf, Py-Spy).\nExpertise in\n\ncloud-based AI inference (AWS Inferentia, Azure ML, GCP AI Platform, Habana Gaudi).\nKnowledge of\n\nhardware-aware optimizations (oneDNN, XLA, cuDNN, ROCm, MLIR, SparseML).\nContributions to\n\nopen-source community\nPublications in International forums / conferences / journals"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-principal-machine-learning-engineer-atlassian-bengaluru-10-to-12-years-270325503041",
        "Job Title": "Principal Machine Learning Engineer",
        "Company": "Atlassian",
        "Job Description": {
            "Description": "As a Principal Machine Learning engineer, you will drive the development and implementation of the cutting edge machine learning algorithms, training sophisticated models, collaborating with product, engineering, and analytics teams, to build the AI functionalities into each Atlassian products and services. Your daily responsibilities will encompass a broad spectrum of tasks such as designing system and model architectures, conducting rigorous experimentation and model evaluations, and providing guidance to emerging ML engineers. Your role is pivotal, stretching beyond these tasks, ensuring AIs transformative potential is realized across our offerings.\nQualifications\nOn the first day, well expect you to have\n10+ years of total experience, 5+ years of related industry experience in the MLE / data science domain\nFluency in Python\nSolid understanding of machine learning concepts and algorithms, including supervised and unsupervised learning, deep learning, and NLP.\nFamiliarity with popular ML libraries like sci-kit-learn, Keras/TensorFlow/PyTorch, numpy, pandas\nGood Understanding of Machine Learning project lifecycle\nExperience in architecting and implementing high-performance RESTful microservices ( API development for ML Models )\nFamiliarity with MLOps and experience with scaling and deploying Machine Learning models\nFocus on business practicality and the 80/20 rule; very high bar for output quality, but recognize the business benefit of having something nowvs perfection sometime in the future\nAgile development mindset, appreciating the benefit of constant iteration and improvement\nIts Great, But Not Required, If You Have\nExperience in developing deep learning-based models and working on LLM-related applications\nExcelling in solving ambiguous and complex problems, being able to navigate through uncertain situations, breaking down complex challenges into manageable components and developing innovative solutions.\nExperience or passion on building cutting edge developer tools products with AI/ML"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-5-adobe-systems-india-pvt-ltd-bengaluru-10-to-15-years-270325506446",
        "Job Title": "Machine Learning Engineer 5",
        "Company": "Adobe",
        "Job Description": {
            "Description": "This opportunity is with the Spend Optimizer group. In collaboration with a team of highly motivated data scientists and engineers, you will apply reinforcement learning, time series analysis, bayesian modeling, Gen AI frameworks to optimize ad spends.\nWhat youll Do\nTechnically lead and guide team of skilled machine learning engineers to design and implement ML algorithms/models\nCollaborate with multi-functional teams to determine technical requirements\nDevelop and deploy scalable machine learning solutions that optimize Adobe s products and services, deliver value to clients and drive customer adoption\nDrive innovation through research and experimentation, encouraging an environment where new ideas can thrive\nMonitor and evaluate the performance of ML models, making vital adjustments to compete at the highest level\nWhat you need to succeed\nOutstanding knowledge of machine learning frameworks and tools such as PyTorch, Tensorflow, Scikit-learn, with strong programming skills in Python\nSolid understanding of core machine learning and statistics, including Bayesian Modeling, Time Series Analysis, Reinforcement Learning, and Optimization\nExperience in developing, deploying and maintaining ML models in a production environment\nAbility to thrive in a collaborative, inclusive, and diverse workplace, embracing different perspectives and ideas\nIdeal Candidate Profile:\nA total of 10+ years of experience in an applied Machine Learning setting, delivering cloud-scale, data-driven products, and services\nPhD or master s in Computer Science/ Applied Math/Statistics/ related field.\nExperience and domain expertise in Digital ad technologies is desirable.\nComfort with ambiguity, adaptability to evolving priorities, and an ability to influence technical and non-technical collaborators"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-staff-machine-learning-engineer-netradyne-bengaluru-5-to-8-years-010425500884",
        "Job Title": "Staff Machine Learning Engineer",
        "Company": "Netradyne",
        "Job Description": {
            "Description": "You will be embedded within a team of machine learning engineers and data scientists, responsible for building and productizing generative AI and deep learning solutions.\nYou will:\nDesign, develop and deploy production ready scalable solutions that utilizes GenAI, Traditional ML models, Data science and ETL pipelines\nCollaborate with cross-functional teams to integrate AI-driven solutions into business operations.\nBuild and enhance frameworks for automation, data processing, and model deployment.\nUtilize Gen-AI tools and workflows to improve the efficiency and effectiveness of AI solutions.\nConduct research and stay updated with the latest advancements in generative AI and related technologies.\nDeliver key product features within cloud analytics.\nRequirements:\nTech, M. Tech or PhD in computer science, electrical engineering, statistics or math.\nAt least 5 years of working experience in data science, computer vision, or related domain.\nProven experience with building and deploying generative AI solutions.\nStrong programming skills in Python and solid fundamentals in computer science, particularly in algorithms, data structures, and OOP.\nExperience with Gen-AI tools and workflows.\nProficiency in both vision-related AI and data analysis using generative AI.\nExperience with cloud platforms and deploying models at scale.\nExperience with transformer architectures and large language models (LLMs).\nFamiliarity with frameworks such as TensorFlow, PyTorch, and Hugging Face.\nProven leadership and team management skills.\nDesired skills:\nWorking experience with AWS, Azure AI tools is a plus.\nTechnologies such as: Kafka streams, Queues, Rest API systems.\nPrograming language: Python, SQL, C++ (good to have)\nTools: Pytorch, FastAPI, MLFlow, Hugging face pipelines, Langgraph, OpenAI\nKnowledge of best practices in software development, including version control, testing, and continuous integration"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-staff-machine-learning-engineer-eightfold-ai-bengaluru-6-to-10-years-280325502417",
        "Job Title": "Staff Machine Learning Engineer",
        "Company": "Eightfold Ai",
        "Job Description": {
            "Description": "About Eightfold.ai Eightfold.ai is at the forefront of innovation in the AI-driven HR tech space. Were not just building software; were shaping the future of how organizations find, manage, and empower their talent. Our groundbreaking AI platform is revolutionizing the industry, and were looking for exceptional engineers to join our team and drive the next wave of advancements. About the AI/ML Team Our AI/ML team is the driving force behind Eightfolds cutting-edge solutions. Were a group of passionate experts who thrive on pushing the boundaries of applied machine learning. We work with massive datasets, tackle complex challenges, and collaborate to create AI models that are transforming the way companies approach talent management. What You Will Do Lead and inspire: Mentor and guide a team of talented ML Engineers, fostering a culture of innovation and collaboration. Architect and implement: Design and build scalable, robust, and efficient ML pipelines that power our core products. Innovate and optimize: Develop novel algorithms and continuously improve our existing models for performance, accuracy, and scalability. Solve complex problems: Tackle challenging real-world problems in areas like natural language processing, recommendation systems, and predictive analytics. Stay ahead of the curve: Research and implement state-of-the-art techniques in deep learning, reinforcement learning, and other emerging fields. Design and Development: Implement scalable solutions using LLMs, Fine-tune LLMs for specific NLP tasks, Develop and deploy LLM-powered applications What You Bring Deep expertise: Strong foundation in Machine Learning, Deep Learning, and NLP, with a proven track record of developing and deploying ML models at scale. Technical leadership: Experience leading and mentoring teams, with excellent communication and collaboration skills. Problem-solving mindset: Ability to analyze complex problems, think critically, and develop innovative solutions. Passion for AI: A genuine enthusiasm for pushing the boundaries of AI and its applications in the real world. Advanced skills: Proficiency in Python and relevant ML frameworks (TensorFlow, PyTorch, etc.), as well as experience with big data technologies (Hadoop, Spark). Strong CS fundamentals and coding languages (Python, C/C++, Hava, Scala, R) GenAI Large Language Model: Experience in developing and deploying LLM-powered applications, Knowledge of LLM fine-tuning techniques and optimization strategies. Understanding of LLM ethical considerations and biases Nice to Haves MInimum of 6-10+ years of relevant work experience in ML and AI MS or PhD in Computer Science or a related field Publications in top-tier AI conferences Experience with GenAI, LLMs, and Transformers Contributions to open-source ML projects Join Us and Shape the Future of AI If youre a senior AI/ML engineer whos ready to make a real impact, wed love to hear from you. Eightfold.ai offers a dynamic and rewarding environment where youll have the opportunity to work on cutting-edge projects, collaborate with world-class experts, and accelerate your career growth. Join us and help build the future of AI-powered talent intelligence. Hybrid Work @ Eightfold: We embrace a hybrid work model that aims to boost collaboration, enhance our culture, and drive innovation through a blend of remote and in-person work. Experience our comprehensive benefits with family medical, vision and dental coverage, a competitive base salary, and eligibility for equity awards and discretionary bonuses or commissions. LI-Hybrid"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-maersk-global-service-centres-india-pvt-ltd-bengaluru-4-to-6-years-270325504151",
        "Job Title": "Machine Learning Engineer",
        "Company": "A.P. Moller Maersk",
        "Job Description": {
            "Description": "Machine Learning and simulation engineer\nMaersk, the world s largest shipping company responsible for moving 20 % of global trade, is on a mission to become the Global Integrator of Container Logistics. To achieve this, we are transforming into an industrial digital giant by combining our assets across air, land, ocean, and ports with our growing portfolio of digital assets to connect and simplify our customer s supply chain through global end-to-end solutions, all the while rethinking the way we engage with customers and partners.\nIn this role as ML and simulation engineer on the Global Data and Analytics (GDA) team, you will be working on our new strategic visibility initiative to develop advanced simulation and optimization solutions for emissions. The overall objective is to further evolve our existing Emissions Studio product ( https://www. maersk. com / digital-solutions / emissions-dashboard ) with scenario analysis, and AI/ML-powered emissions optimization, which will unlock significant value to our customers as they look to make informed tradeoff decisions on emissions reductions while understanding the impact to transportation time and cost. Building on top of an existing product with an existing customer base, you will be partnering with product managers and engineering counterparts to develop scalable solutions following industry best-practices. You will be empowered to take ownership of your domain and we expect you to proactively contribute to identifying opportunities and solutions. There is a lot of exciting challenges ahead of us, and the ideal candidate will have a passion for working on industry-transforming products and creating impact from the ground up in a fast-paced environment.\nTo deliver on this scope, we are looking for a candidate with strong problem solving skills with demonstrated hands-on experience in machine learning and scenario simulation. It would be ideal if you are also familiar with mathematical optimization (constrained optimization leveraging techniques from Operations Research such as linear programming), but this is not a must. You should furthermore have experience taking solutions to production in collaboration with colleagues from data engineering and software engineering.\nNo prior knowledge of logistics needed; we will help you learn what you ll need to succeed.\nKey responsibilities\nDevelop, test, and deploy technical solutions for forecasting, prediction, scenario simulation and optimization, as well as other analytical tools together with the team. In addition to the topics mentioned above, this can also include building integrated data sets, analyses and dashboarding\nLead model development, implementation and deployment end-to-end incl. MLOps (mindset and technical implementation using our stack). Specifically, you will drive problem formulation, modeling approach, implementation, testing, deployment and monitoring.\nCollaborate with software engineers and data engineers to deploy recommendation solutions to production\nPartner with product managers to drive maturation of ideas into production solutions, including challenging problem formulation\nCommunicate effectively with technical and non-technical audiences\nBasic qualifications\nBSc/MSc/PhD in computer science, data science or related discipline with 5+ years of industry experience building cloud-based ML solutions for production at scale, including solution architecture and solution design experience\nGood problem solving skills, for both technical and non-technical domains\nGood broad understanding of ML and statistics covering standard ML for regression and classification, forecasting and time-series modeling, deep learning.\n3+ years of hands-on experience building ML solutions in Python, incl knowledge of common python data science libraries (e. g. scikit-learn, PyTorch, etc)\nHands-on experience building end-to-end data products based on AI/ML technologies\nSome experience with scenario simulations.\nExperience with collaborative development workflow: version control (we use github), code reviews, DevOps (incl automated testing), CI/CD\nTeam player, eager to collaborate and good collaborator\nPreferred qualifications\nIn addition to basic qualifications, would be great if you have\nHands-on experience with common OR solvers such as Gurobi\nExperience with a common dashboarding technology (we use PowerBI) or web-based frontend such as Dash, Streamlit, etc.\nExperience working in cross-functional product engineering teams following agile development methodologies (scrum/Kanban/ )\nExperience with Spark and distributed computing\nStrong hands-on experience with MLOps solutions, including open source solutions.\nExperience with cloud-based orchestration technologies, e. g. Airflow, KubeFlow, etc\nExperience with containerization (Kubernetes & Docker)\n. .\n."
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-4-firefly-genai-services-adobe-systems-india-pvt-ltd-noida-bengaluru-8-to-10-years-260325505931",
        "Job Title": "Machine Learning Engineer 4, Firefly GenAI Services",
        "Company": "Adobe",
        "Job Description": {
            "Description": "In this role, youll:\nOptimize and scale state-of-the-art generative AI models.\nDeploy AI-driven creative tools that empower millions globally.\nSolve real-world challenges in AI scalability and production readiness.\nJob Responsibilities\nHelp architect and optimize large-scale foundation model pipelines in Generative AI\nDesign and develop the GenAI backend services for Firefly, creating GPU optimized, efficient model pipelines that power the generative AI features on Firefly website, PPro, Photoshop, Illustrator, Express, Stock and other applications/surfaces\nCollaborate with outstanding Applied researchers and engineers to bring ideas to production\nProvide technical leadership and mentorship for junior team members\nExplore and research new and emerging ML and MLOps technologies to continuously improve Adobe s GenAI engineering effectiveness and efficiency\nReview and provide feedback on features, technology, architecture, designs and test strategies.\nWhat youll need to succeed\nMasters or Ph.D. in Computer Science, AI/ML, or related fields or B.Tech and strong experience in AI/ML\n8+ years of experience\nExcellent communication and technical leadership skills\nExperience in tech working with a large number of contributors on time-sensitive and business-critical GenAI projects\nExperience in the latest Generative AI technologies, such as GAN, diffusion, transformer models\nStrong hands-on experience with large-scale GenAI model pipelines and/or shipping ML features\nStrong collaboration skills. Experience with working in a Matrix organization, driving alignment, drawing conclusions, and getting things done\nPreferred experience:\nExperience training or optimizing models (CUDA, Triton, TRT, AOT)\nExperience converting models from various frameworks like PyTorch and TensorFlow to other target formats to ensure compatibility and optimized performance across different platforms\nGood publication record in Computer Science, AI/ML, or related fields"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-quantiphi-analytics-solutions-pvt-ltd-mumbai-bengaluru-thiruvananthapuram-0-to-3-years-250325500077",
        "Job Title": "Machine Learning Engineer",
        "Company": "Quantiphi Analytics Solutions",
        "Job Description": {
            "Description": "While technology is the heart of our business, a global and diverse culture is the heart of our success. We love our people and we take pride in catering them to a culture built on transparency, diversity, integrity, learning and growth.\n\n\nIf working in an environment that encourages you to innovate and excel, not just in professional but personal life, interests you- you would enjoy your career with Quantiphi!\nWe are looking for experienced Machine Learning Engineers to join our team, focused on building Agentic AI workflows, fine-tuning Large Language Models (LLMs), performing prompt engineering, and applying related generative AI techniques. The ideal candidate will have expertise in cutting-edge AI technologies and the ability to design, develop, and deploy AI solutions that can autonomously perform tasks with minimal human intervention.\nIf you like wild growth and working with happy, enthusiastic over-achievers, youll enjoy your career with us !"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-54-lakhsctc-kandi-srinivasa-reddy-vcloud-technologies-investment-noida-chennai-bengaluru-13-to-15-years-290325005146",
        "Job Title": "Machine Learning Engineer 54 LakhsCTC || Kandi Srinivasa Reddy",
        "Company": "Integra Technologies",
        "Job Description": {
            "Description": "Dear Candidate,\nWe are looking for an experienced Machine Learning Engineer to develop and deploy ML models for real-world applications. If you have expertise in Python, TensorFlow, and data science pipelines, wed love to hear from you!\n\nKey Responsibilities:\nDesign, develop, and deploy machine learning models for predictive analytics.\nWork with large datasets to train and fine-tune models.\nOptimize model performance and scalability.\nImplement MLOps practices for model deployment and monitoring.\nCollaborate with data scientists and engineers on AI/ML projects.\nRequired Skills & Qualifications:\nStrong programming skills in Python and ML libraries (TensorFlow, PyTorch, Scikit-learn).\nExperience with deep learning, NLP, or computer vision.\nKnowledge of cloud-based ML services (AWS SageMaker, Azure ML, Google AI).\nFamiliarity with data preprocessing, feature engineering, and model evaluation.\nUnderstanding of MLOps and CI/CD for machine learning pipelines.\nSoft Skills:\nStrong analytical and problem-solving abilities.\nAbility to work with cross-functional teams.\nExcellent communication and presentation skills.\nNote: If interested, please share your updated resume and preferred time for a discussion. If shortlisted, our HR team will contact you.\n\nKandi Srinivasa Reddy\nDelivery Manager\nIntegra Technologies"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-atlassian-bengaluru-1-to-4-years-260325501698",
        "Job Title": "Machine Learning Engineer",
        "Company": "Atlassian",
        "Job Description": {
            "Description": "Working at Atlassian\nAtlassians have flexibility in where they work - whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.\n\",\"responsibilities\":\"\nAs a Machine Learning engineer, you will independently work on the development and implementation of the cutting edge machine learning algorithms, training sophisticated models, collaborating with engineering and analytics teams, to build the AI functionality for Atlassian.\nYour daily responsibilities will encompass a broad spectrum of tasks such as understanding system and model architectures, conducting rigorous experimentation and model evaluations and dealing with related problems.\nYour role is pivotal, stretching beyond these tasks, ensuring AIs transformative potential is realized across Atlassian products and platforms.\n\",\"qualifications\":\"\nOn the first day, well expect you to have\nBachelors or Masters degree (preferably a Computer Science degree or equivalent experience)\n5+ years of related industry experience in the data science domain\nExposure in Python or Java with and the ability to write performant production-quality code, familiarity with SQL, knowledge of Spark and cloud data environments (e.g. AWS, Databricks)\nExposure to building and scaling machine learning models in business applications using large amounts of data.\nAbility to communicate and explain data science concepts to diverse audiences, craft a compelling story.\nFocus on business practicality and the 80/20 rule; very high bar for output quality, but recognize the business benefit of having something nowvs perfection sometime in the future.\nAgile development mindset, appreciating the benefit of constant iteration and improvement.\nGood to have\nEnd to end exposure of integrating AI/ML capabilities in products ( frontend or backend tech stack).\nExperience working in a consumer or B2C space for a SaaS product provider, or the enterprise/B2B space\nExperience in independently dealing with deep learning-based models and working on LLM-related applications\nExcelling in solving ambiguous and complex problems, being able to navigate through uncertain situations, breaking down complex challenges into manageable components and developing innovative solutions\nOur perks & benefits\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit"
        }
    },
    {
        "Job URL": "https://www.naukri.com/job-listings-machine-learning-engineer-mlops-tiger-analytics-hyderabad-chennai-bengaluru-3-to-8-years-190325017175",
        "Job Title": "Machine Learning Engineer (MLOPS)",
        "Company": "Tiger Analytics",
        "Job Description": {
            "Description": "Need Immediate/Serving NP candidate\nMust have skills- MLops,End to End deployment,Data pipeline,Python,Machine Learning\n\nCurious about the role? What your typical day would look like?We are looking for a Senior Analyst or Machine Learning Engineer who will work on a broad range of cutting-edge data analytics and machine learning problems across a variety of industries. More specifically, you will\nEngage with clients to understand their business context.\nTranslate business problems and technical constraints into technical requirements for the desired analytics solution.\nCollaborate with a team of data scientists and engineers to embed AI and analytics into the business decision processes.\nWhat do we expect?\n3+  years of experience with at least 1+ years of relevant DS experience.\nProficient  in a structured Python (Mandate)\nProficient in any one of cloud technologies is mandatory ( AWS/ Azure/ GCP)\nFollows good software engineering practices and has an interest in building reliable and robust software.\nGood understanding of DS concepts and DS model lifecycle.\nWorking knowledge of Linux or Unix environments ideally in a cloud environment.\nWorking knowledge of Spark/ PySpark is desirable.\nModel deployment / model monitoring experience is desirable.\nCI/CD pipeline creation is good to have."
        }
    }
]